{
    "Apple___Apple_scab":{
        "title":"Apple Scab",
        "des":"A serious disease of apples and ornamental crabapples, apple scab (Venturia inaequalis) attacks both leaves and fruit. The fungal disease forms pale yellow or olive-green spots on the upper surface of leaves. Dark, velvety spots may appear on the lower surface. Severely infected leaves become twisted and puckered and may drop early in the summer. Symptoms on fruit are similar to those found on leaves. Scabby spots are sunken and tan and may have velvety spores in the center. As these spots mature, they become larger and turn brown and corky. Infected fruit becomes distorted and may crack allowing entry of secondary organisms. Severely affected fruit may drop, especially when young. Apple scab overwinters primarily in fallen leaves and in the soil. Disease development is favored by wet, cool weather that generally occurs in spring and early summer. Fungal spores are carried by wind, rain or splashing water from the ground to flowers, leaves or fruit. During damp or rainy periods, newly opening apple leaves are extremely susceptible to infection. The longer the leaves remain wet, the more severe the infection will be. Apple scab spreads rapidly between 55-75 degrees F."
    },
    "Apple___Black_rot":{
        "title":"Apple Black Rot",
        "des":"Black rot is a disease of apples that infects fruit, leaves and bark caused by the fungus Botryosphaeria obtusa. It can also jump to healthy tissue on pear or quince trees, but is typically a secondary fungus of weak or dead tissues in other plants. Begin checking your apple trees for signs of infection about a week after the petals fall from your apple blossoms. Early symptoms are often limited to leaf symptoms such as purple spots on upper leaf surfaces. As these spots age, the margins remain purple, but the centers dry out and turn yellow to brown. Over time, the spots expand and heavily infected leaves drop from the tree. Infected branches or limbs will show characteristic red-brown sunken areas that expand each year."
    },
    "Apple___Cedar_apple_rust":{
        "title":"Apple Cedar Rust",
        "des":"Cedar apple rust (Gymnosporangium juniperi-virginianae) is a fungal disease that requires juniper plants to complete its complicated two year life-cycle. Spores overwinter as a reddish-brown gall on young twigs of various juniper species. In early spring, during wet weather, these galls swell and bright orange masses of spores are blown by the wind where they infect susceptible apple and crab-apple trees. The spores that develop on these trees will only infect junipers the following year. From year to year, the disease must pass from junipers to apples to junipers again; it cannot spread between apple trees. On apple and crab-apple trees, look for pale yellow pinhead sized spots on the upper surface of the leaves shortly after bloom. These gradually enlarge to bright orange-yellow spots which make the disease easy to identify. Orange spots may develop on the fruit as well. Heavily infected leaves may drop prematurely."
    },
    "Apple___healthy":{
        "title":"Apple Healthy",
        "des":"An apple is a sweet, edible fruit produced by an apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek and European Christian tradition."
    },
    "Blueberry___healthy":{
        "title":"Blueberry Healthy",
        "des":"Blueberries are perennial flowering plants with blue– or purple–colored berries. They are classified in the section Cyanococcus within the genus Vaccinium. Vaccinium also includes cranberries, bilberries, huckleberries and Madeira blueberries. Commercial blueberries – including both wild ('lowbush') and cultivated ('highbush') blueberries – are all native to North America. The highbush blueberry varieties were introduced into Europe during the 1930s."
    },
    "Cherry_(including_sour)___Powdery_mildew":{
        "title":"Cherry Powdery Mildew",
        "des":"Powdery mildew of sweet and sour cherry is caused by Podosphaera clandestina, an obligate biotrophic fungus. Mid- and late-season sweet cherry (Prunus avium) cultivars are commonly affected, rendering them unmarketable due to the covering of white fungal growth on the cherry surface. Season long disease control of both leaves and fruit is critical to minimize overall disease pressure in the orchard and consequently to protect developing fruit from accumulating spores on their surfaces."
    },
    "Cherry_(including_sour)___healthy":{
        "title":"Cherry Healthy",
        "des":"A cherry is the fruit of many plants of the genus Prunus, and is a fleshy drupe (stone fruit). Commercial cherries are obtained from cultivars of several species, such as the sweet Prunus avium and the sour Prunus cerasus. The name 'cherry' also refers to the cherry tree and its wood, and is sometimes applied to almonds and visually similar flowering trees in the genus Prunus, as in ornamental cherry or cherry blossom. Wild cherry may refer to any of the cherry species growing outside cultivation, although Prunus avium is often referred to specifically by the name wild cherry in the British Isles."
    },
    "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot":{
        "title":"Corn Cercospora Leaf Spot",
        "des":"Grey leaf spot (GLS) is a foliar fungal disease that affects maize, also known as corn. GLS is considered one of the most significant yield-limiting diseases of corn worldwide. There are two fungal pathogens that cause GLS: Cercospora zeae-maydis and Cercospora zeina. Symptoms seen on corn include leaf lesions, discoloration (chlorosis), and foliar blight. Distinct symptoms of GLS are rectangular, brown to gray necrotic lesions that run parallel to the leaf, spanning the spaces between the secondary leaf veins."
    },
    "Corn_(maize)___Common_rust_":{
        "title":"Corn common rust",
        "des":"Common corn rust, caused by the fungus Puccinia sorghi, is the most frequently occurring of the two primary rust diseases of corn in the U.S., but it rarely causes significant yield losses in Ohio field (dent) corn. Occasionally field corn, particularly in the southern half of the state, does become severely affected when weather conditions favor the development and spread of the rust fungus. Sweet corn is generally more susceptible than field corn. In years with exceptionally cool summers, and especially on late-planted fields or sweet corn, yield losses may occur when the leaves at and above the ears become severely diseased before grain fill is complete."
    },
    "Corn_(maize)___Northern_Leaf_Blight":{
        "title":"Corn Northern Leaf Blight",
        "des":"Northern corn leaf blight (NCLB), caused by the fungus Exserohilum turcicum, is one of the most frequently occurring foliar diseases of corn in Ohio and the Midwest in general. Since the early 2000s, both the prevalence and severity of this disease have increased, but in most years plants only becomes severely diseased well after silking. During wet weather yield losses may be as high as 30-50% if the disease becomes establishes before tasseling. However, if leaf damage is only moderate or is delayed until 6 weeks after silking, yield losses are minimal. Severe damage caused by NCLB also predisposes plants to stalk rot and lodging, which may further reduce yield and grain quality."
    },
    "Corn_(maize)___healthy":{
        "title":"Corn Healthy",
        "des":"Maize (/meɪz/ MAYZ; Zea mays subsp. mays, from Spanish: maíz after Taino: mahiz), also known as corn, is a cereal grain first domesticated by indigenous peoples in southern Mexico about 10,000 years ago. The leafy stalk of the plant produces pollen inflorescences and separate ovuliferous inflorescences called ears that yield kernels or seeds, which are fruits."
    },
    "Grape___Black_rot":{
        "title":"Grape Black Rot",
        "des":"Black rot, caused by the fungus Guignardia bidwellii, is a serious disease of cultivated and wild grapes. The disease is most destructive in warm, wet seasons. It attacks all green parts of the vine – leaves, shoots, leaf and fruit stems, tendrils, and fruit. The most damaging effect is to the fruit. Note: Guignardia bidwellii forma parthenocissi causes a leaf spot on Boston ivy and Virginia creeper. Control is as for black rot of grapes."
    },
    "Grape___Esca_(Black_Measles)":{
        "title":"",
        "des":""
    },
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)":{
        "title":"",
        "des":""
    },
    "Grape___healthy":{
        "title":"",
        "des":""
    },
    "Orange___Haunglongbing_(Citrus_greening)":{
        "title":"",
        "des":""
    },
    "Peach___Bacterial_spot":{
        "title":"",
        "des":""
    },
    "Peach___healthy":{
        "title":"",
        "des":""
    },
    "Pepper,_bell___Bacterial_spot":{
        "title":"",
        "des":""
    },
    "Pepper,_bell___healthy":{
        "title":"",
        "des":""
    },
    "Potato___Early_blight":{
        "title":"",
        "des":""
    },
    "Potato___Late_blight":{
        "title":"",
        "des":""
    },
    "Potato___healthy":{
        "title":"",
        "des":""
    },
    "Raspberry___healthy":{
        "title":"",
        "des":""
    },
    "Soybean___healthy":{
        "title":"",
        "des":""
    },
    "Squash___Powdery_mildew":{
        "title":"",
        "des":""
    },
    "Strawberry___Leaf_scorch":{
        "title":"",
        "des":""
    },
    "Strawberry___healthy":{
        "title":"",
        "des":""
    },
    "Tomato___Bacterial_spot":{
        "title":"",
        "des":""
    },
    "Tomato___Early_blight":{
        "title":"",
        "des":""
    },
    "Tomato___Late_blight":{
        "title":"",
        "des":""
    },
    "Tomato___Leaf_Mold":{
        "title":"",
        "des":""
    },
    "Tomato___Septoria_leaf_spot":{
        "title":"",
        "des":""
    },
    "Tomato___Spider_mites Two-spotted_spider_mite":{
        "title":"",
        "des":""
    },
    "Tomato___Target_Spot":{
        "title":"",
        "des":""
    },
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus":{
        "title":"",
        "des":""
    },
    "Tomato___Tomato_mosaic_virus":{
        "title":"",
        "des":""
    },
    "Tomato___healthy":{
        "title":"",
        "des":""
    }
}